#include "N.hpp"

/*Написать класс Position, задающий положение фигуры (координаты x,y на экране). Реализовать возможность изменять положение.

Написать классы Окружность и Квадрат  как наследники Position.
реализовать методы периметр и площадь. Дополнительные свойства к position - не более 1. 

Написать класс ОкружностьВКвадрате как наследник классов Окружность и Квадрат (описывает класс всевозможных фигур, каждая из которых представляют из себя окружность, вписанную в квадрат). Описать свой вариант решения проблемы (кристалл смерти, алмаз смерти, множественное наследование, виртуальный конструктор - ключевые слова для поиска решения проблемы с конструкторами). Никаких дополнительных свойств по отношению к родительским классам не создавать.

Можно дописывать свои методы. 
В каждом классе реализовать минимум 2 конструктора.*/