Изучить теоретический материал из прикрепленного файла. 

Написать программу, которая выводит на экран 

1)      ФИО, номер группы;

2)      минимальные и максимальные значения встроенных типов данных, а так же их размер;

3)      запросить у пользователя некоторое целое число и вывести на экран это число в бинарном и шестнадцатиричном виде, а так же результат преобразования типов ко всем встроенным;

4)      записать условие и полное решение уравнения вида a*x=b (a отлично от нуля), причем значения коэффициентов (целые числа) вводит пользователь;

5)      записать программу для нахождения середины отрезка, заданного целыми координатами концевых точек.

**компиляция Valgrind происходит через "make vallg"(мое вольное сокращение)
